In [1]:
import pandas as pd
df = pd.read_csv("holiday.csv")
df.head()

,Destinations,Feedback_Score,Hotel_Star_Rating,No_of_Inclusive_hotels,Most_visited_City
0,Abkhazia,5,5,718,Sukhumi
1,Afghanistan,2,2,540,Kabul
2,Akrotiri and Dhekelia,5,4,1351,Episkopi Cantonment
3,Albania,4,4,592,Tirana
4,Algeria,2,4,684,Algiers

In [2]:
df.shape

(248, 5)

In [3]:
df.iloc[3:8]

,Destinations,Feedback_Score,Hotel_Star_Rating,No_of_Inclusive_hotels,Most_visited_City
3,Albania,4,4,592,Tirana
4,Algeria,2,4,684,Algiers
5,American Samoa,4,2,818,Pago Pago
6,Andorra,4,3,1052,Andorra la Vella
7,Angola,8,1,860,Luanda

In [4]:
df.loc[3:8]

,Destinations,Feedback_Score,Hotel_Star_Rating,No_of_Inclusive_hotels,Most_visited_City
3,Albania,4,4,592,Tirana
4,Algeria,2,4,684,Algiers
5,American Samoa,4,2,818,Pago Pago
6,Andorra,4,3,1052,Andorra la Vella
7,Angola,8,1,860,Luanda
8,Anguilla,8,4,850,The Valley

In [5]:
df['No_of_Inclusive_hotels'].mean()

999.1975806451613

In [6]:
df.mean()

C:\Users\theam\AppData\Local\Temp\ipykernel_4952\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Feedback_Score              5.729839
Hotel_Star_Rating           2.915323
No_of_Inclusive_hotels    999.197581
dtype: float64

In [7]:
df.min()

Destinations               Abkhazia
Feedback_Score                    1
Hotel_Star_Rating                 1
No_of_Inclusive_hotels          501
Most_visited_City         Abu Dhabi
dtype: object

In [8]:
df.max()

Destinations              Zimbabwe
Feedback_Score                  10
Hotel_Star_Rating                5
No_of_Inclusive_hotels        1496
Most_visited_City           Zagreb
dtype: object

In [9]:
df.loc[df['Feedback_Score'] > 9, ['Destinations']]

                       Destinations
18                          Bahrain
19                       Bangladesh
23                           Belize
28                          Bolivia
41                   Cayman Islands
64                    Easter Island
74   Federated States of Micronesia
81                           Gambia
86                           Greece
118                          Latvia
123                   Liechtenstein
127                      Madagascar
138                          Monaco
139                        Mongolia
141                      Montserrat
146                         Namibia
160        Northern Mariana Islands
167                Papua New Guinea
186       Saint Pierre and Miquelon
192                         Senegal
219                        Thailand
220                            Togo
233         United Kingdom; England
238                         Vanuatu
241                         Vietnam

In [11]:
filt = df['Feedback_Score'] > 8
filt

0      False
1      False
2      False
3      False
4      False
       ...
243    False
244    False
245    False
246     True
247    False
Name: Feedback_Score, Length: 248, dtype: bool

In [12]:
lowfil = df['Feedback_Score'] <2
lowfil

0      False
1      False
2      False
3      False
4      False
       ...
243    False
244    False
245     True
246    False
247    False
Name: Feedback_Score, Length: 248, dtype: bool